#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.

HELP_1 = """
❡━━━━━ ❂ اوامـــر الميـــوزك ❂━━━━━ ❡

✅**<u>اوامر الادمن:</u>**

𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
• إليك اوامر التحكم بالمقاطع المشغله ( دآخل المجموعات )  •
• الاوامر تعمل بدون استخدام اي علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓

◍ -『 **وقف** 』\n لإيقاف المقطع مؤقتآ داخل المحادثه الصوتيه  •
◍ -『 **كمل** 』\n لاستئناف المقطع مره اخري داخل المحادثه الصوتيه  •
◍ -『 **اسكت** 』\n لكتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **اتكلم** 』\n لألغاء كتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **تخطي او التالي** 』\n للتخطي إلي المقطع المنتظر بقائمة الانتظار لديك  •
◍ -『 **ايقاف او انهاء** 』\n لأنهاء التشغيل ومغادره المساعد المحادثه الصوتيه  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
• إليك اوامر التحكم بالمقاطع المشغله ( دآخل القنوات )  •
• الاوامر تعمل بدون استخدام اي علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓

◍ -『 **وقف** 』\n لإيقاف المقطع مؤقتآ داخل المحادثه الصوتيه  •
◍ -『 **كمل** 』\n لاستئناف المقطع مره اخري داخل المحادثه الصوتيه  •
◍ -『 **اسكت** 』\n لكتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **اتكلم** 』\n لألغاء كتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **تخطي او التالي** 』\n للتخطي إلي المقطع المنتظر بقائمة الانتظار لديك  •
◍ -『 **ايقاف او انهاء** 』\n لأنهاء التشغيل ومغادره المساعد المحادثه الصوتيه  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓.

❡━━━━━ ❂اوامـــر الميـــوزك ❂━━━━━ ❡"""


HELP_2 = """❡━━━━━ ❂ اوامـــر الميـــوزك ❂━━━━━ ❡

✅<u>**اوامرالتشغيل :**</u>

• اوامر تشغيل البوت في الجروبات والقنوات  •
• الاوامر تعمل بدون استخدام اي علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
◍ - اوامر تشغيل البوت في المجموعات 

◍ -『 **تشغيل او شغل ** 』\n ثم اسم المقطع الصوتي او الرابط الخاص به  •
◍ -『 **شغل او تشغيل** 』\n ثم اسم مقطع الفيديو او الرابط الخاص به  •
◍ -『 **بحث او تنزيل** 』\n ثم اسم المقطع المراد تنزيله من موقع اليوتيوب مباشر او الرابط الخاص به  •
◍ -『 **ريلود** 』\n قم بأرسالها ( دآخل المجموعات ) لتحديث قائمه المشرفين بمجموعتك  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
◍ - **جزء القنوات** 
◍ - اوامر تشغيل البوت في القنوات  ⟱ 

◍ -『 **غني** 』\n ثم اسم المقطع الصوتي او الرابط الخاص به لتشغيله بقناتك  •
◍ -『 **غني** 』\nثم اسم الفيديو او الرابط الخاص به لتشغيله بقناتك  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓.

❡━━━━━ ❂اوامـــر الميـــوزك ❂━━━━━ ❡"""


HELP_3 = """❡━━━━━ ❂ اوامـــر الميـــوزك ❂━━━━━ ❡

✅<u>**اوامر البوت:**</u>

𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓
• إليك قسم ( الاوامر الاضافيه ) للبوت  •
• جميع الاوامر تعمل بدون علامات  •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓

◍ -『 **حدد** 』\n ثم رقم المجموعات الذي تستخدم بوتك فيديو بنفس الوقت •

◍ -『 **وضع شغل** 』\n لضبط وضع تحكم التشغيل للأدمن او للاعضاء داخل مجموعتك  •

◍ -『 **القائمه** 』\n لعرض قائمه التشغيل الخاصه بك  •

◍ -『 **حذف القائمه** 』\n لحذف قائمه التشغيل الخاصه بك  •

◍ -『 **لغه** 』\n لتغيير لغة البوت إلي اي لغه اخري  •

◍ -『 **احصائيات** 』\n لعرض قسم الاحصائيات العامه للبوت ولترند التشغيل العالمي •

◍ -『 **ريلود** 』\n لتحديث قائمة المشرفين داخل مجموعتك •

◍ -『 **بينج** 』\n لقياس سرعه التشغيل على السيرفر وعرض تفاصيل معلومات التشغيل •

◍ -『 **كلمات** 』\n ثم اسم الاغنيه لجلب كلمات الاغنيه كامله بصيغه النصوص •

◍ -『 **ابحث** 』\n ثم اسم المقطع او الرابط الخاص به لتحميله مباشر من اليوتيوب •
𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓𓏓

❡━━━━━ ❂اوامـــر الميـــوزك ❂━━━━━ ❡"""

HELP_4 = """ ❡━━━━━ ❂ اوامـــر الميـــوزك ❂━━━━━ ❡

» اوامر التشغيل في القناة ✅:

» غني   - لتشغيل الموسيقى   

«تخطي - لـ تشغيل الاغنيه التاليه

« ايقاف او انهاء - لـ إيقاف التشغيل 

» بحث او تنزيل - لتنزيل مقطع في اليوتيوب

» بنج - عرض سرعة الاستجابة

❡━━❂ 𝗦𝗢𝗨𝗥𝗖𝗘 𝗔𝗠𝗕𝗥𝗔 𓅛 - اوامــر الميــوزك ❂━━ ❡ """

HELP_5 = """**<u> مطـور السـورس :</u>**

||[ㅤ𓏺 ѕᴏʀᴄᴇ ᴀᴍʙʀᴏ 𓅛⚔ . ˼](https://t.me/ASAKIOP)|| """

HELP_6 = """ ❡━━━━━ ❂ اوامـــر الميـــوزك ❂━━━━━ ❡

/addsudo - اضافة مطور

/delsudo - حذف مطور

/reboot - إعادة تشغيل البوت

/speedtest - سرعة الخادم

/block + معرف الشخص لحظره

/unblock + معرف الشخص لرفع حظره

/blockedusers - المحظورين

/gban + معرف الشخص لحظره عام

/ungban + معرف الشخص لالغاء حظره عام

/gbannedusers - المحظورين عام

/broadcast -user -assistant -pin + 

الرسالة لأذاعتها ⟰

/logger [disable | enable] 

معرفة من يستخدم البوت ⟰

/blacklistchat + معرف القناة او المجموعة 

لحظر جروب  ⟰

/whitelistchat + معرف القناة او المجموعة 

لرفع حظرها ⟰

/blacklistedchat - 

المجموعات والقنوات المحظورة ⟰

❡━━━━━ ❂اوامـــر الميـــوزك ❂━━━━━ ❡
"""
